### Terraform Apply ✅ Succeeded

<details><summary>Show apply output</summary>

```
module.devops.tls_private_key.ssh_key: Refreshing state... [id=e258ae1e311871c57d4f60314821c86a618c855b]
module.devops.tls_private_key.ssh_key_customer: Refreshing state... [id=fa3faeff01a53fb23eba3ca1813c2b628bf0635c]
module.devops.aws_ssm_parameter.private_key: Refreshing state... [id=/key_pairs/flyflow/private_key]
module.devops.aws_ssm_parameter.public_key_customer: Refreshing state... [id=/shared/flyflow_customers/public_key]
module.devops.aws_ssm_parameter.customer_account_id: Refreshing state... [id=/shared/application/ec2/aws-account-id]
module.devops.aws_ssm_parameter.aws_secret_key: Refreshing state... [id=/devops/aws_secret_key]
module.devops.aws_ssm_parameter.public_key: Refreshing state... [id=/key_pairs/aws_flyflow/public_key]
module.devops.aws_key_pair.ec2_key_pair: Refreshing state... [id=aws_flyflow_generated]
module.devops.aws_security_group.allow_ssh_customers: Refreshing state... [id=sg-06f9e598ebaab5538]
module.devops.aws_dynamodb_table.tfstate_locking: Refreshing state... [id=tfstate-locking-new]
module.devops.aws_ssm_parameter.github_token: Refreshing state... [id=/devops/github_token]
module.devops.aws_ssm_parameter.aws_access_key_id: Refreshing state... [id=/devops/aws_access_key_id]
module.devops.aws_s3_bucket.grafana_backup: Refreshing state... [id=flyflow-grafana-backups-staging]
module.devops.aws_s3_bucket.jenkins_backup: Refreshing state... [id=flyflow-jenkins-backup-staging]
module.devops.aws_route53_zone.my_domain: Refreshing state... [id=Z01823541YF2W4LAQSP9W]
module.devops.aws_key_pair.ec2_key_pair_customer: Refreshing state... [id=customers_aws_key]
module.devops.aws_s3_bucket.flyflow_artifact_bucket: Refreshing state... [id=flyflow-artifacts-staging]
module.devops.aws_ssm_parameter.customer_sg: Refreshing state... [id=/shared/application/ec2/server-sg]
module.devops.aws_route53_record.jenkins_subdomain: Refreshing state... [id=Z01823541YF2W4LAQSP9W_jenkins.flyflow.io_A]
module.devops.aws_ssm_parameter.route53_nameservers: Refreshing state... [id=/route53/nameservers]
module.devops.aws_route53_record.cname_record: Refreshing state... [id=Z01823541YF2W4LAQSP9W_www.flyflow.io_CNAME]
module.devops.aws_s3_bucket_versioning.grafana_versioning: Refreshing state... [id=flyflow-grafana-backups-staging]
module.devops.aws_iam_policy.grafana_s3_policy: Refreshing state... [id=arn:aws:iam::580186901909:policy/grafana-s3-backup-policy]
module.devops.aws_iam_policy.jenkins_s3_policy: Refreshing state... [id=arn:aws:iam::580186901909:policy/jenkins-s3-backup-policy]
module.devops.aws_s3_bucket_versioning.versioning: Refreshing state... [id=flyflow-jenkins-backup-staging]
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_REGION"]: Refreshing state... [id=auth-service:AWS_REGION]
module.devops.github_actions_secret.shared_secrets["auth-service.GH_FLYFLOW_TOKEN"]: Refreshing state... [id=auth-service:GH_FLYFLOW_TOKEN]
module.devops.github_actions_secret.shared_secrets["auth-service.ARTIFACT_BUCKET"]: Refreshing state... [id=auth-service:ARTIFACT_BUCKET]
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=auth-service:AWS_SECRET_ACCESS_KEY]
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_ACCESS_KEY_ID"]: Refreshing state... [id=auth-service:AWS_ACCESS_KEY_ID]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.devops.aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "flyflow-ecs-staging"
      + tags_all           = (known after apply)

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.devops.module.ec2.aws_iam_instance_profile.ecs_instance_profile will be created
  + resource "aws_iam_instance_profile" "ecs_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ecsInstanceProfile"
      + path        = "/"
      + role        = "ecsInstanceRoleFinal"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.devops.module.ec2.aws_iam_role.ecs_instance_role will be created
  + resource "aws_iam_role" "ecs_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecsInstanceRoleFinal"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.devops.module.ec2.aws_iam_role_policy_attachment.ecs_instance_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_instance_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "ecsInstanceRoleFinal"
    }

  # module.devops.module.ec2.aws_instance.ecs_instance[0] will be created
  + resource "aws_instance" "ecs_instance" {
      + ami                                  = "ami-053e7be1410d7eb72"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "ecsInstanceProfile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-07ba043f755b81b33"
      + tags                                 = {
          + "Name" = "flyflow-ecs-staging"
        }
      + tags_all                             = {
          + "Name" = "flyflow-ecs-staging"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "966995c51053f2dd260c833c2ceedea95a755a2d"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # module.devops.module.ec2.aws_security_group.ecs_sg will be created
  + resource "aws_security_group" "ecs_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0d875e56be488e3e5"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
module.devops.aws_ecs_cluster.this: Creating...
module.devops.module.ec2.aws_iam_role.ecs_instance_role: Creating...
module.devops.module.ec2.aws_security_group.ecs_sg: Creating...
module.devops.module.ec2.aws_iam_role.ecs_instance_role: Creation complete after 2s [id=ecsInstanceRoleFinal]
module.devops.module.ec2.aws_iam_role_policy_attachment.ecs_instance_policy: Creating...
module.devops.module.ec2.aws_iam_instance_profile.ecs_instance_profile: Creating...
module.devops.module.ec2.aws_iam_role_policy_attachment.ecs_instance_policy: Creation complete after 0s [id=ecsInstanceRoleFinal-20251229205225895500000002]
module.devops.module.ec2.aws_iam_instance_profile.ecs_instance_profile: Creation complete after 0s [id=ecsInstanceProfile]
module.devops.module.ec2.aws_security_group.ecs_sg: Creation complete after 5s [id=sg-0cce653f2df457d02]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Creating...
module.devops.aws_ecs_cluster.this: Still creating... [10s elapsed]
module.devops.aws_ecs_cluster.this: Creation complete after 11s [id=arn:aws:ecs:us-east-1:580186901909:cluster/flyflow-ecs-staging]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Still creating... [10s elapsed]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Creation complete after 19s [id=i-0c3d7df26d9a6b986]

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

```
</details>